---
kind: enumMember
id: F:Autodesk.Revit.DB.DistributionOfNormals.OnEachFacet
enum: Autodesk.Revit.DB.DistributionOfNormals
source: html/8e00e7aa-b39b-51b4-26e4-0f5c1404df32.htm
---
# Autodesk.Revit.DB.DistributionOfNormals.OnEachFacet

There is one normal vector per each facet of the polymesh.